stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rtc_ex.h
/** @defgroup RTCEx_Tamper_Pin_Precharge_Duration  RTCEx Tamper Pin Precharge Duration
  * @{
  */
#define RTC_TAMPERPRECHARGEDURATION_1RTCCLK  0U                                              /*!< Tamper pins are pre-charged before sampling during 1 RTCCLK cycle  */
#define RTC_TAMPERPRECHARGEDURATION_2RTCCLK  TAMP_FLTCR_TAMPPRCH_0                           /*!< Tamper pins are pre-charged before sampling during 2 RTCCLK cycles */
#define RTC_TAMPERPRECHARGEDURATION_4RTCCLK  TAMP_FLTCR_TAMPPRCH_1                           /*!< Tamper pins are pre-charged before sampling during 4 RTCCLK cycles */
#define RTC_TAMPERPRECHARGEDURATION_8RTCCLK  (TAMP_FLTCR_TAMPPRCH_0 | TAMP_FLTCR_TAMPPRCH_1) /*!< Tamper pins are pre-charged before sampling during 8 RTCCLK cycles */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Pull_UP  RTCEx Tamper Pull UP
  * @{
  */
#define RTC_TAMPER_PULLUP_ENABLE           0U                    /*!< Tamper pins are pre-charged before sampling */
#define RTC_TAMPER_PULLUP_DISABLE          TAMP_FLTCR_TAMPPUDIS  /*!< Tamper pins pre-charge is disabled          */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_TimeStampOnTamperDetection RTCEx Tamper TimeStamp On Tamper Detection Definitions
  * @{
  */
#define RTC_TIMESTAMPONTAMPERDETECTION_DISABLE  0U               /*!< TimeStamp on Tamper Detection event is not saved */
#define RTC_TIMESTAMPONTAMPERDETECTION_ENABLE   RTC_CR_TAMPTS    /*!< TimeStamp on Tamper Detection event saved        */
/**
  * @}
  */

/** @defgroup RTCEx_Tamper_Detection_Output RTCEx Tamper detection output Definitions
  * @{
  */
#define RTC_TAMPERDETECTIONOUTPUT_DISABLE  0U                    /*!< Tamper detection output disable on TAMPALRM */
#define RTC_TAMPERDETECTIONOUTPUT_ENABLE   RTC_CR_TAMPOE         /*!< Tamper detection output enable on TAMPALRM  */
/**
  * @}
  */


/** @defgroup RTCEx_Tamper_Interrupt  RTCEx Tamper Interrupt
  * @{
  */
#define RTC_IT_TAMP_1                      TAMP_IER_TAMP1IE      /*!< Tamper 1 Interrupt */
#define RTC_IT_TAMP_2                      TAMP_IER_TAMP2IE      /*!< Tamper 2 Interrupt */
#define RTC_IT_TAMP_3                      TAMP_IER_TAMP3IE      /*!< Tamper 3 Interrupt */
#define RTC_IT_TAMP_4                      TAMP_IER_TAMP4IE      /*!< Tamper 4 Interrupt */
#define RTC_IT_TAMP_5                      TAMP_IER_TAMP5IE      /*!< Tamper 5 Interrupt */
#define RTC_IT_TAMP_ALL                    (RTC_IT_TAMP_1 | RTC_IT_TAMP_2 |\
                                            RTC_IT_TAMP_3 | RTC_IT_TAMP_4 |\
                                            RTC_IT_TAMP_5)
/**
  * @}
  */

/** @defgroup RTCEx_Internal_Tamper_Interrupt  RTCEx Internal Tamper Interrupt
  * @{
  */
#define RTC_IT_INT_TAMP_3                  TAMP_IER_ITAMP3IE     /*!< Tamper 3 internal Interrupt  */
#define RTC_IT_INT_TAMP_5                  TAMP_IER_ITAMP5IE     /*!< Tamper 5 internal Interrupt  */
#define RTC_IT_INT_TAMP_6                  TAMP_IER_ITAMP6IE     /*!< Tamper 6 internal Interrupt  */
#define RTC_IT_INT_TAMP_7                  TAMP_IER_ITAMP7IE     /*!< Tamper 7 internal Interrupt  */
#define RTC_IT_INT_TAMP_8                  TAMP_IER_ITAMP8IE     /*!< Tamper 8 internal Interrupt  */
#define RTC_IT_INT_TAMP_9                  TAMP_IER_ITAMP9IE     /*!< Tamper 9 internal Interrupt  */
#define RTC_IT_INT_TAMP_11                 TAMP_IER_ITAMP11IE    /*!< Tamper 11 internal Interrupt */
#define RTC_IT_INT_TAMP_12                 TAMP_IER_ITAMP12IE    /*!< Tamper 12 internal Interrupt */
#define RTC_IT_INT_TAMP_13                 TAMP_IER_ITAMP13IE    /*!< Tamper 13 internal Interrupt */
#define RTC_IT_INT_TAMP_ALL                (RTC_IT_INT_TAMP_3  | RTC_IT_INT_TAMP_5  |\
                                            RTC_IT_INT_TAMP_6  | RTC_IT_INT_TAMP_7  |\
                                            RTC_IT_INT_TAMP_8  | RTC_IT_INT_TAMP_9  |\
                                            RTC_IT_INT_TAMP_11 | RTC_IT_INT_TAMP_12 |\
                                            RTC_IT_INT_TAMP_13)
/**
  * @}
  */

/** @defgroup RTCEx_Flags  RTCEx Flags
  * @{
  */
#define RTC_FLAG_TAMP_1                    TAMP_SR_TAMP1F
#define RTC_FLAG_TAMP_2                    TAMP_SR_TAMP2F
#define RTC_FLAG_TAMP_3                    TAMP_SR_TAMP3F
#define RTC_FLAG_TAMP_4                    TAMP_SR_TAMP4F
#define RTC_FLAG_TAMP_5                    TAMP_SR_TAMP5F
#define RTC_FLAG_TAMP_ALL                  (RTC_FLAG_TAMP_1 | RTC_FLAG_TAMP_2 | RTC_FLAG_TAMP_3 |\
                                            RTC_FLAG_TAMP_4 | RTC_FLAG_TAMP_5)

#define RTC_FLAG_INT_TAMP_3                TAMP_SR_ITAMP3F
#define RTC_FLAG_INT_TAMP_5                TAMP_SR_ITAMP5F
#define RTC_FLAG_INT_TAMP_6                TAMP_SR_ITAMP6F
#define RTC_FLAG_INT_TAMP_7                TAMP_SR_ITAMP7F
#define RTC_FLAG_INT_TAMP_8                TAMP_SR_ITAMP8F
#define RTC_FLAG_INT_TAMP_9                TAMP_SR_ITAMP9F
#define RTC_FLAG_INT_TAMP_11               TAMP_SR_ITAMP11F
#define RTC_FLAG_INT_TAMP_12               TAMP_SR_ITAMP12F
#define RTC_FLAG_INT_TAMP_13               TAMP_SR_ITAMP13F
#define RTC_FLAG_INT_TAMP_ALL              (RTC_FLAG_INT_TAMP_3  | RTC_FLAG_INT_TAMP_5  |\
                                            RTC_FLAG_INT_TAMP_6  | RTC_FLAG_INT_TAMP_7  |\
                                            RTC_FLAG_INT_TAMP_8  | RTC_FLAG_INT_TAMP_9  |\
                                            RTC_FLAG_INT_TAMP_11 | RTC_FLAG_INT_TAMP_12 |\
                                            RTC_FLAG_INT_TAMP_13)
/**
  * @}
  */


/** @defgroup RTCEx_MonotonicCounter_Instance  RTCEx Monotonic Counter Instance Definition
  * @{
  */
#define RTC_MONOTONIC_COUNTER_1            0U                    /*!< Monotonic counter 1 */
/**
  * @}
  */

/** @defgroup RTCEx_Backup_Registers  RTCEx Backup Registers Definition
  * @{
  */
#define RTC_BKP_NUMBER                     RTC_BKP_NB
#define RTC_BKP_DR0                        0x00U
#define RTC_BKP_DR1                        0x01U
#define RTC_BKP_DR2                        0x02U
#define RTC_BKP_DR3                        0x03U
#define RTC_BKP_DR4                        0x04U
#define RTC_BKP_DR5                        0x05U
#define RTC_BKP_DR6                        0x06U
#define RTC_BKP_DR7                        0x07U
#define RTC_BKP_DR8                        0x08U
#define RTC_BKP_DR9                        0x09U
#define RTC_BKP_DR10                       0x0AU
#define RTC_BKP_DR11                       0x0BU
#define RTC_BKP_DR12                       0x0CU
#define RTC_BKP_DR13                       0x0DU
#define RTC_BKP_DR14                       0x0EU
#define RTC_BKP_DR15                       0x0FU
#define RTC_BKP_DR16                       0x10U
#define RTC_BKP_DR17                       0x11U
#define RTC_BKP_DR18                       0x12U
#define RTC_BKP_DR19                       0x13U
#define RTC_BKP_DR20                       0x14U
#define RTC_BKP_DR21                       0x15U
#define RTC_BKP_DR22                       0x16U
#define RTC_BKP_DR23                       0x17U
#define RTC_BKP_DR24                       0x18U
#define RTC_BKP_DR25                       0x19U
#define RTC_BKP_DR26                       0x1AU
#define RTC_BKP_DR27                       0x1BU
#define RTC_BKP_DR28                       0x1CU
#define RTC_BKP_DR29                       0x1DU
#define RTC_BKP_DR30                       0x1EU
#define RTC_BKP_DR31                       0x1FU
/**
  * @}
  */

